; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f11-p21-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 
             p20 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)

(above f7 f8)
(above f7 f9)
(above f7 f10)

(above f8 f9)
(above f8 f10)

(above f9 f10)



(origin p0 f10)
(destin p0 f6)

(origin p1 f9)
(destin p1 f2)

(origin p2 f1)
(destin p2 f8)

(origin p3 f8)
(destin p3 f6)

(origin p4 f5)
(destin p4 f0)

(origin p5 f3)
(destin p5 f0)

(origin p6 f1)
(destin p6 f10)

(origin p7 f0)
(destin p7 f8)

(origin p8 f10)
(destin p8 f3)

(origin p9 f7)
(destin p9 f8)

(origin p10 f5)
(destin p10 f7)

(origin p11 f2)
(destin p11 f8)

(origin p12 f3)
(destin p12 f1)

(origin p13 f4)
(destin p13 f7)

(origin p14 f4)
(destin p14 f1)

(origin p15 f2)
(destin p15 f3)

(origin p16 f2)
(destin p16 f1)

(origin p17 f0)
(destin p17 f10)

(origin p18 f7)
(destin p18 f4)

(origin p19 f9)
(destin p19 f2)

(origin p20 f10)
(destin p20 f6)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
(served p18)
(served p19)
(served p20)
))
)

; plan
1. (up f0 f7)
   deleted: (lift-at f0)
   added: (lift-at f7)
   goals met: 0 of 21
2. (board f7 p18)
   added: (boarded p18)
   goals met: 0 of 21
3. (down f7 f5)
   deleted: (lift-at f7)
   added: (lift-at f5)
   goals met: 0 of 21
4. (board f5 p4)
   added: (boarded p4)
   goals met: 0 of 21
5. (board f5 p10)
   added: (boarded p10)
   goals met: 0 of 21
6. (down f5 f4)
   deleted: (lift-at f5)
   added: (lift-at f4)
   goals met: 0 of 21
7. (depart f4 p18)
   deleted: (boarded p18)
   added: (served p18)
   goals met: 1 of 21
8. (board f4 p14)
   added: (boarded p14)
   goals met: 1 of 21
9. (board f4 p13)
   added: (boarded p13)
   goals met: 1 of 21
10. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 1 of 21
11. (board f3 p5)
   added: (boarded p5)
   goals met: 1 of 21
12. (board f3 p12)
   added: (boarded p12)
   goals met: 1 of 21
13. (down f3 f0)
   deleted: (lift-at f3)
   added: (lift-at f0)
   goals met: 1 of 21
14. (depart f0 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 2 of 21
15. (depart f0 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 3 of 21
16. (board f0 p7)
   added: (boarded p7)
   goals met: 3 of 21
17. (board f0 p17)
   added: (boarded p17)
   goals met: 3 of 21
18. (up f0 f7)
   deleted: (lift-at f0)
   added: (lift-at f7)
   goals met: 3 of 21
19. (board f7 p9)
   added: (boarded p9)
   goals met: 3 of 21
20. (depart f7 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 4 of 21
21. (depart f7 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 5 of 21
22. (up f7 f9)
   deleted: (lift-at f7)
   added: (lift-at f9)
   goals met: 5 of 21
23. (board f9 p1)
   added: (boarded p1)
   goals met: 5 of 21
24. (board f9 p19)
   added: (boarded p19)
   goals met: 5 of 21
25. (down f9 f2)
   deleted: (lift-at f9)
   added: (lift-at f2)
   goals met: 5 of 21
26. (board f2 p11)
   added: (boarded p11)
   goals met: 5 of 21
27. (board f2 p15)
   added: (boarded p15)
   goals met: 5 of 21
28. (board f2 p16)
   added: (boarded p16)
   goals met: 5 of 21
29. (depart f2 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 6 of 21
30. (depart f2 p19)
   deleted: (boarded p19)
   added: (served p19)
   goals met: 7 of 21
31. (down f2 f1)
   deleted: (lift-at f2)
   added: (lift-at f1)
   goals met: 7 of 21
32. (board f1 p2)
   added: (boarded p2)
   goals met: 7 of 21
33. (board f1 p6)
   added: (boarded p6)
   goals met: 7 of 21
34. (depart f1 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 8 of 21
35. (depart f1 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 9 of 21
36. (depart f1 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 10 of 21
37. (up f1 f10)
   deleted: (lift-at f1)
   added: (lift-at f10)
   goals met: 10 of 21
38. (board f10 p0)
   added: (boarded p0)
   goals met: 10 of 21
39. (board f10 p20)
   added: (boarded p20)
   goals met: 10 of 21
40. (board f10 p8)
   added: (boarded p8)
   goals met: 10 of 21
41. (depart f10 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 11 of 21
42. (depart f10 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 12 of 21
43. (down f10 f3)
   deleted: (lift-at f10)
   added: (lift-at f3)
   goals met: 12 of 21
44. (depart f3 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 13 of 21
45. (depart f3 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 14 of 21
46. (up f3 f8)
   deleted: (lift-at f3)
   added: (lift-at f8)
   goals met: 14 of 21
47. (board f8 p3)
   added: (boarded p3)
   goals met: 14 of 21
48. (depart f8 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 15 of 21
49. (depart f8 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 16 of 21
50. (depart f8 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 17 of 21
51. (depart f8 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 18 of 21
52. (down f8 f6)
   deleted: (lift-at f8)
   added: (lift-at f6)
   goals met: 18 of 21
53. (depart f6 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 19 of 21
54. (depart f6 p20)
   deleted: (boarded p20)
   added: (served p20)
   goals met: 20 of 21
55. (depart f6 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 21 of 21
